# specify install directory
cask_args appdir: '/Applications'
# install packages, languages, and programs
tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true

# Install iTerm2
cask 'iterm2'
# Source control and other utilities
brew 'git'
brew 'tree'

# Applications
cask 'google-chrome'
cask 'visual-studio-code'
cask 'spotify'
cask 'firefox'
cask 'intelij-de-ce'

# Languages
cask 'java'
brew 'node'
brew 'mongodb'
brew 'python3'
brew 'go'
brew 'elasticsearch'

# Docker
cask 'docker'
