# specify install directory
cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "bat"
brew "eza"
brew "broot"
brew "ffmpeg"
brew "gh"
brew "jq"
brew "mise"
brew "yq"
brew "btop"
brew "awscli"
brew "starship"
brew "zoxide"
brew huseyinbabal/tap/taws
brew ymtdzzz/tap/otel-tui

cask "zen"
cask "spotify"
cask "firefox"
cask "zed"
cask "ghostty"
cask "claude-code"
